[{"model": "docs.docspage", "pk": 36, "fields": {"short_title": "Libraries", "long_title": "Libraries", "type": "category", "order": 6, "parent": null, "content": "Libraries are made up of spectra (spectra, collapsed spectra, and spectra XML) and metadata.\r\n\r\nMetadata for strains in libraries can be aligned with NCBI taxonomy IDs from NCBI's Taxonomy Browser.", "slug": "libraries"}}, {"model": "docs.docspage", "pk": 37, "fields": {"short_title": "Registration", "long_title": "Registration", "type": "category", "order": 0, "parent": null, "content": "Registration is required in order to use certain site functionality such as basic file search and data management.", "slug": "registration"}}, {"model": "docs.docspage", "pk": 38, "fields": {"short_title": "Search", "long_title": "Search", "type": "category", "order": 1, "parent": null, "content": "", "slug": "basic-search"}}, {"model": "docs.docspage", "pk": 39, "fields": {"short_title": "Metadata", "long_title": "Metadata", "type": "sub-category", "order": 3, "parent": 36, "content": "-", "slug": "metadata"}}, {"model": "docs.docspage", "pk": 40, "fields": {"short_title": "NCBI taxonomy search", "long_title": "Using the NCBI taxonomy search alignment tool", "type": "sub-category", "order": 1, "parent": 36, "content": "-", "slug": "using-the-ncbi-taxonomy-alignment-tools"}}, {"model": "docs.docspage", "pk": 41, "fields": {"short_title": "Simple search", "long_title": "Simple search", "type": "sub-category", "order": 1, "parent": 38, "content": "Simple search compares an unknown sample against known libraries.\r\n\r\nUnknown samples are preprocessed to filter for prominent peaks in the spectra. Replicates in uploaded files are collapsed to produce an averaged spectra for the sample. Averaged spectra are then compared against spectra in known libraries with cosine similarity used as the similarity measurement.", "slug": "simple-search"}}, {"model": "docs.docspage", "pk": 43, "fields": {"short_title": "User", "long_title": "User", "type": "sub-category", "order": 1, "parent": 37, "content": "To register as a new user on the site, open the \"Register\" link from the navigation menu and follow the steps there to create a new site account.\r\n\r\n![](/media/register.png)", "slug": "user"}}, {"model": "docs.docspage", "pk": 44, "fields": {"short_title": "Lab", "long_title": "Lab", "type": "sub-category", "order": 2, "parent": 37, "content": "Every new user is assigned a default lab group.\r\n\r\nLab groups can contain zero or more spectra libraries, and are moderated by a set of owners and accessible by a set of members.\r\n\r\nLab groups help to organize datasets (libraries) on the site. All spectra and metadata added to the site are kept in libraries. In turn, libraries are kept in lab groups.\r\n\r\nAs a future feature, users will be able to invite other site users to join their labs, as well as request to join the labs of other users.", "slug": "lab"}}, {"model": "docs.docspage", "pk": 45, "fields": {"short_title": "File upload", "long_title": "File upload", "type": "category", "order": 5, "parent": null, "content": "File upload currently works as part of the simple search.", "slug": "file-upload"}}, {"model": "docs.docspage", "pk": 46, "fields": {"short_title": "Examples", "long_title": "Examples", "type": "category", "order": 8, "parent": null, "content": "", "slug": "examples"}}, {"model": "docs.docspage", "pk": 79, "fields": {"short_title": "IDBac SQLite + NCBI", "long_title": "Upload an IDBac SQLite file and align metadata with NCBI's Taxonomy Browser", "type": "sub-category", "order": 1, "parent": 46, "content": "*1)* Add a new library.\r\n\r\nFrom the main menu select \"Add: Library\" to add a new library.\r\n\r\n![](/media/newlibrary.png)\r\n\r\n*2)* Add a new IDBac SQLite file, or select an existing R01 dataset file.\r\n\r\nFrom the main menu select \"Add: IDBac SQLite\".\r\n\r\n![](/media/newsqlite.png)\r\n\r\nSelect \"Upload a single IDBac SQLite file\" to upload an SQLite file.\r\n\r\nAlternatively, select \"Load a single hosted IDBac R01 data file\" to load one or more sample SQLite files already hosted online.\r\n\r\n*3)* When the SQLite addition task completes, collapse the library entry's replicates.\r\n\r\nFind the new library from the main menu under \"Browse: Libraries\".\r\n\r\n![](/media/libraries.png)\r\n\r\nUnder the \"Collapse replicates\" column, click \"collapse\" to run the collapse procedure on the library's replicates.\r\n\r\n*4)* When the collapse task is complete, open the library's detail page to align the library with NCBI's taxonomy data.\r\n\r\n![](/media/libraries2.png)\r\n\r\n*5)* From the \"NCBI taxonomy search\" tab, enter a prefix for searching against NCBI taxonomy data, or leave the prefix blank for a direct comparison.\r\n\r\nClick \"Load alignments\" to perform the search.\r\n\r\n![](/media/ncbisearch.png)\r\n\r\nFor example, a prefix of \"NRRL\" will match a strain titled \"B-784\" with NCBI's \"NRRL B-784\". \r\n\r\n![](/media/ncbisearch2.png)\r\n\r\nExact matches will be shown at the top of the form, while partial matches will be shown below.\r\n\r\nUse the \"Import NCBI taxonomy IDs for exact matches\" button to import taxonomy data for any exact matches.\r\n\r\nIn the bottom of the form, one or more partial matches can be selected for importing.\r\n\r\n![](/media/ncbisearch3.png)\r\n\r\nIn the case of multiple results, use the \"Update ID\" column to select the matching NCBI taxonomy ID of choice.\r\n\r\nClick the \"Add selected Metadata\" button to import any selected partial matches.\r\n\r\n*6)* Use the \"NCBI taxonomy bulk modify\" tool to quickly match a number of strains against NCBI data.\r\n\r\n![](/media/ncbibulk.png)\r\n\r\nStrain IDs represent metadata already added to the site. Details on which strain IDs are in the selected library can also be seen by opening the metadata link on the \"Library details\" page.\r\n\r\n![](/media/ncbibulk2.png)\r\n\r\n![](/media/ncbibulk3.png)\r\n\r\nAgain, click the \"Import NCBI taxonomy IDs for exact matches\" and \"Add selected Metadata\" buttons to import NCBI data.\r\n\r\n![](/media/ncbibulk4.png)", "slug": "adding-an-idbac-sqlite-file-and-aligning-metadata-with-ncbis-taxonomy-browser"}}, {"model": "docs.docspage", "pk": 80, "fields": {"short_title": "Mzml file upload", "long_title": "Upload a set of mzml or mzxml files by utilizing the Basic Search tool", "type": "sub-category", "order": 3, "parent": 46, "content": "*1)* From the main menu, open basic search (\"Menu: Basic Search\").\r\n\r\nClick the \"Show more options\" button.\r\n\r\n![](/media/uploads1.png)\r\n\r\nSelect the option to \"Create new library\" and enter a library name.\r\n\r\nClick \"Choose file(s)\" and select one or more mzml or mzxml files to add to the library.\r\n\r\nClick \"Upload\".\r\n\r\nAfter the upload is complete, the library will be visible from the Library page of the main menu (\"Browse: Libraries\").", "slug": "mzml-file-upload-and-ncbi-alignment"}}, {"model": "docs.docspage", "pk": 81, "fields": {"short_title": "Unknown spectra search", "long_title": "Search one or more unknown samples against R01 data", "type": "sub-category", "order": 2, "parent": 46, "content": "*1)* From the main menu, open \"Menu: Basic Search\".\r\n\r\n![](/media/search1.png)\r\n\r\nClick on \"Choose file(s)\" to select one or more mzml or mzxml files of unknown strains to upload.\r\n\r\nClick \"Upload\" to begin the search process.\r\n\r\n![](/media/search3.png)\r\n\r\nAfter the files have been uploaded, pre-processed, and matched against R01 data, top scoring R01 samples will be shown for each uploaded strain.\r\n\r\nClicking \"Explore more\" will open a \"Result\" tab containing more details on the matching.\r\n\r\n![](/media/search4.png)\r\n\r\nIn the \"Result\" tab, click on any strain in the \"Strain Name\" column to view a mirror plot against the unknown sample.\r\n\r\nA histogram details a cosine similarity scoring distribution of the library against the unknown sample with a select tool to view the distribution by taxonomic rankings.\r\n\r\nThe select tool also controls groupings on the dendrogram.\r\n\r\nThe dendrogram includes a toggle button to toggle between viewing variable and equalized match height.\r\n\r\nClick the \"Search results\" tab to go back to the full list of uploaded files.", "slug": "unknown-spectra-search"}}, {"model": "docs.docspage", "pk": 82, "fields": {"short_title": "NCBI taxonomy bulk modify", "long_title": "Using the NCBI taxonomy bulk modify alignment tool", "type": "sub-category", "order": 2, "parent": 36, "content": "", "slug": "ncbi-taxonomy-bulk-modify"}}, {"model": "docs.docspage", "pk": 83, "fields": {"short_title": "IDBac SQLite datasets", "long_title": "IDBac SQLite datasets", "type": "sub-category", "order": 4, "parent": 36, "content": "Users may choose to import IDBac SQLite datasets onto the site.", "slug": "idbac-sqlite-datasets"}}, {"model": "docs.docspage", "pk": 84, "fields": {"short_title": "R01 Dataset", "long_title": "R01 Dataset", "type": "sub-category", "order": 6, "parent": 36, "content": "", "slug": "r01-dataset"}}, {"model": "docs.docspage", "pk": 85, "fields": {"short_title": "Overview", "long_title": "Overview: MALDI-TOF spectra database", "type": "category", "order": -3, "parent": null, "content": "", "slug": "overview"}}]
